Revit 2024 API
BuiltInFailures.JoinElementsFailures.StructGroupMemberWillDetachFromGrid Property
 A structural element will be detached from grid(s) due to inconsistent group membership.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructGroupMemberWillDetachFromGrid { get; }
Visual Basic
Public Shared ReadOnly Property StructGroupMemberWillDetachFromGrid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructGroupMemberWillDetachFromGrid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace